micropython/micropython/ports/esp32/boards/UM_TINYS3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "TinyS3"
#define MICROPY_HW_MCU_NAME                 "ESP32S3"

#define MICROPY_PY_BLUETOOTH                (0)
#define MICROPY_HW_ENABLE_SDCARD            (0)
#define MICROPY_PY_MACHINE_DAC              (0)

#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)

#define MICROPY_HW_SPI1_MOSI                (35)  // SDO
#define MICROPY_HW_SPI1_MISO                (37)  // SDI
#define MICROPY_HW_SPI1_SCK                 (36)
